# Pandas (Frame work)

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
arr = np.random.randint(0,10,(5,3))

In [ ]:
arr

array([[1, 4, 9],
       [0, 8, 5],
       [8, 2, 4],
       [0, 8, 1],
       [4, 2, 7]])

In [ ]:
df = pd.DataFrame(arr)

In [ ]:
df

   0  1  2
0  1  4  9
1  0  8  5
2  8  2  4
3  0  8  1
4  4  2  7

In [ ]:
df.values

array([[1, 4, 9],
       [0, 8, 5],
       [8, 2, 4],
       [0, 8, 1],
       [4, 2, 7]])

In [ ]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.index=['A','B','C','D','E']
df.columns=['a1','b1','c1']

In [ ]:
df

   a1  b1  c1
A   1   4   9
B   0   8   5
C   8   2   4
D   0   8   1
E   4   2   7

In [ ]:
df.loc['B','b1']

8

In [ ]:
df.iloc[2:4,0:2]

   a1  b1
C   8   2
D   0   8

In [ ]:
#it printsthe0 series.
#Therefore dataframe is a collection of series
df.iloc[0]

a1    1
b1    4
c1    9
Name: A, dtype: int64

In [ ]:
type(df.iloc[0])

pandas.core.series.Series

In [ ]:
df.shape

(5, 3)

In [ ]:
df.T

    A  B  C  D  E
a1  1  0  8  0  4
b1  4  8  2  8  2
c1  9  5  4  1  7

In [ ]:
def create_df(n,m):
  arr=np.random.randint(0,10,(n,m))
  df=pd.DataFrame(arr)
  df.index=['R'+ str(x) for x in np.arange(1,n+1)]
  df.columns=['C'+ str(x) for x in np.arange(1,m+1)]
  return df

In [ ]:
df= create_df(3,4)

In [ ]:
df

    C1  C2  C3  C4
R1   4   1   2   0
R2   0   0   5   0
R3   0   4   7   2

In [ ]:
diameter=pd.Series([8,7,6,5,4,3,2,1],
               index=['earth','mars','Jupiter','neptune','venus','saturn','mercury','uranus'])
m1=pd.Series([1,2,3,4,5,6,7,8],
               index=['earth','mars','Jupiter','neptune','venus','saturn','mercury','uranus'])

In [ ]:
df=pd.DataFrame({'mass' : m1,'diameter': diameter})

In [ ]:
df

         mass  diameter
earth       1         8
mars        2         7
Jupiter     3         6
neptune     4         5
venus       5         4
saturn      6         3
mercury     7         2
uranus      8         1

In [ ]:
df['mass']['earth']

1

In [ ]:
df['pop']=0

In [ ]:
df

         mass  diameter  pop
earth       1         8    0
mars        2         7    0
Jupiter     3         6    0
neptune     4         5    0
venus       5         4    0
saturn      6         3    0
mercury     7         2    0
uranus      8         1    0

In [ ]:
df['pop']['earth']='8bill'

In [ ]:
df

         mass  diameter    pop
earth       1         8  8bill
mars        2         7      0
Jupiter     3         6      0
neptune     4         5      0
venus       5         4      0
saturn      6         3      0
mercury     7         2      0
uranus      8         1      0

In [ ]:
#Here the answer is false because pop is an nbuilt function in pandas
df['pop'] is df.pop

False

In [ ]:
df['mass'] is df.mass

True

In [ ]:
df.loc['avg']=[np.mean(m1),np.mean(diameter),'NAN']

In [ ]:
df

         mass  diameter    pop
earth     1.0       8.0  8bill
mars      2.0       7.0      0
Jupiter   3.0       6.0      0
neptune   4.0       5.0      0
venus     5.0       4.0      0
saturn    6.0       3.0      0
mercury   7.0       2.0      0
uranus    8.0       1.0      0
avg       4.5       4.5    NAN

In [ ]:
df.loc[:,'mass']

earth      1.0
mars       2.0
Jupiter    3.0
neptune    4.0
venus      5.0
saturn     6.0
mercury    7.0
uranus     8.0
avg        4.5
Name: mass, dtype: float64

In [ ]:
df.loc['earth']

mass            1
diameter        8
pop         8bill
Name: earth, dtype: object

In [ ]:
#inplace =True means it ensures that the change made  are permanent
#axis =1 means that to delete the whole column
df.drop('pop',axis=1,inplace=True)

In [ ]:
df

         mass  diameter
earth     1.0       8.0
mars      2.0       7.0
Jupiter   3.0       6.0
neptune   4.0       5.0
venus     5.0       4.0
saturn    6.0       3.0
mercury   7.0       2.0
uranus    8.0       1.0
avg       4.5       4.5

In [ ]:
df.loc['mean']=[np.mean(df[col])for col in df.columns]

In [ ]:
df

         mass  diameter
earth     1.0       8.0
mars      2.0       7.0
Jupiter   3.0       6.0
neptune   4.0       5.0
venus     5.0       4.0
saturn    6.0       3.0
mercury   7.0       2.0
uranus    8.0       1.0
avg       4.5       4.5
mean      4.5       4.5

In [ ]:
df.loc['average']=df.mean()

In [ ]:
df

         mass  diameter
earth     1.0       8.0
mars      2.0       7.0
Jupiter   3.0       6.0
neptune   4.0       5.0
venus     5.0       4.0
saturn    6.0       3.0
mercury   7.0       2.0
uranus    8.0       1.0
avg       4.5       4.5
mean      4.5       4.5
average   4.5       4.5

In [ ]:
df.mean(axis=1)

earth      4.5
mars       4.5
Jupiter    4.5
neptune    4.5
venus      4.5
saturn     4.5
mercury    4.5
uranus     4.5
avg        4.5
mean       4.5
average    4.5
dtype: float64

In [ ]:
df['Row Mean']= df.mean(axis=1)

In [ ]:
df

         mass  diameter  Row Mean
earth     1.0       8.0       4.5
mars      2.0       7.0       4.5
Jupiter   3.0       6.0       4.5
neptune   4.0       5.0       4.5
venus     5.0       4.0       4.5
saturn    6.0       3.0       4.5
mercury   7.0       2.0       4.5
uranus    8.0       1.0       4.5
avg       4.5       4.5       4.5
mean      4.5       4.5       4.5
average   4.5       4.5       4.5

In [ ]:
df.drop('avg')

         mass  diameter  Row Mean
earth     1.0       8.0       4.5
mars      2.0       7.0       4.5
Jupiter   3.0       6.0       4.5
neptune   4.0       5.0       4.5
venus     5.0       4.0       4.5
saturn    6.0       3.0       4.5
mercury   7.0       2.0       4.5
uranus    8.0       1.0       4.5
mean      4.5       4.5       4.5
average   4.5       4.5       4.5

In [ ]:
df.min()

mass        1.0
diameter    1.0
Row Mean    4.5
dtype: float64

In [ ]:
df.max()

mass        8.0
diameter    8.0
Row Mean    4.5
dtype: float64

In [ ]:
df.min(axis=1)

earth      1.0
mars       2.0
Jupiter    3.0
neptune    4.0
venus      4.0
saturn     3.0
mercury    2.0
uranus     1.0
avg        4.5
mean       4.5
average    4.5
dtype: float64

In [ ]:
df.quantile(0.25)

mass        3.5
diameter    3.5
Row Mean    4.5
Name: 0.25, dtype: float64

In [ ]:
#very important
df.describe()

           mass  diameter  Row Mean
count  11.00000  11.00000      11.0
mean    4.50000   4.50000       4.5
std     2.04939   2.04939       0.0
min     1.00000   1.00000       4.5
25%     3.50000   3.50000       4.5
50%     4.50000   4.50000       4.5
75%     5.50000   5.50000       4.5
max     8.00000   8.00000       4.5

In [ ]:

df.loc['mmmean']=0

In [ ]:
df

         mass  diameter  Row Mean
earth     1.0       8.0       4.5
mars      2.0       7.0       4.5
Jupiter   3.0       6.0       4.5
neptune   4.0       5.0       4.5
venus     5.0       4.0       4.5
saturn    6.0       3.0       4.5
mercury   7.0       2.0       4.5
uranus    8.0       1.0       4.5
avg       4.5       4.5       4.5
mean      4.5       4.5       4.5
average   4.5       4.5       4.5
mmmean    0.0       0.0       0.0

In [ ]:
df.drop('mmmean',inplace=True)

In [ ]:
df

         mass  diameter  Row Mean
earth     1.0       8.0       4.5
mars      2.0       7.0       4.5
Jupiter   3.0       6.0       4.5
neptune   4.0       5.0       4.5
venus     5.0       4.0       4.5
saturn    6.0       3.0       4.5
mercury   7.0       2.0       4.5
uranus    8.0       1.0       4.5
avg       4.5       4.5       4.5
mean      4.5       4.5       4.5
average   4.5       4.5       4.5

# Seaborn

In [ ]:
import seaborn as sns
import pandas as pd
import numpy as np

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
df=sns.load_dataset('planets')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [ ]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [ ]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [ ]:
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [ ]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [ ]:

df1=pd.DataFrame()

In [ ]:
df1=df.dropna()

In [ ]:
df1.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
#iter rows displays the total series
#it iterates row wise
for i,r in df.iterrows():
  print(i,r)
  break

0 method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [ ]:
for i,r in df.iterrows():
  if pd.isnull(r).any():
    df.drop(i,inplace=True)

In [ ]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
df=sns.load_dataset('planets')

In [ ]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [ ]:
df[df.loc[:,'year'] == 2010]

                        method  number  orbital_period  mass  distance  year
9              Radial Velocity       2      452.800000  1.99     74.79  2010
10             Radial Velocity       2      883.000000  0.86     74.79  2010
39   Eclipse Timing Variations       2     5573.550000   NaN    500.00  2010
40   Eclipse Timing Variations       2     2883.500000   NaN    500.00  2010
45             Radial Velocity       1      380.800000  1.80     20.21  2010
..                         ...     ...             ...   ...       ...   ...
987                    Transit       1        1.219867   NaN    116.14  2010
988                    Transit       1        4.317678   NaN    120.00  2010
991                    Transit       1        3.577469   NaN    343.00  2010
992                    Transit       1        6.871815   NaN    110.00  2010
994                    Transit       1        3.052401   NaN    180.00  2010

[102 rows x 6 columns]

In [ ]:
dff=df.copy()
dff=dff.dropna()

In [ ]:
x=dff.distance.quantile(0.75)

In [ ]:
for i,r in dff.iterrows():
  if r['year'] < 2010:
    dff.drop(i,inplace=True)
    continue
  if r['method'] !='Radial Velocity' and r['method']!='Transit':
    dff.drop(i,inplace=True)
    continue
  if r['distance'] < x:
    dff.drop(i,inplace=True)

In [ ]:
dff.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

In [ ]:
dfd=df.copy()
dfd=dfd.dropna()
x=dfd.distance.quantile(0.75)

In [ ]:
print(x)

59.3325

In [ ]:
dfd=dfd[
    (dfd['year']>=2010) &
    ((dfd['method']=='Radial Velocity') | (dfd['method']=='Transit'))&
    (dfd['distance']>x)

]

In [ ]:
dfd.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

In [ ]:
df.method.unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [ ]:
short_name={}
for s in df.method.unique():
  short_name[s]=''.join([x[0] for x in s.split(' ')])

In [ ]:
short_name

{'Astrometry': 'A',
 'Eclipse Timing Variations': 'ETV',
 'Imaging': 'I',
 'Microlensing': 'M',
 'Orbital Brightness Modulation': 'OBM',
 'Pulsar Timing': 'PT',
 'Pulsation Timing Variations': 'PTV',
 'Radial Velocity': 'RV',
 'Transit': 'T',
 'Transit Timing Variations': 'TTV'}

In [ ]:
for i,r in df.iterrows():
  df.loc[i,'shortform']=short_name.get(r['method'],r['method'])

In [ ]:
df.head()

            method  number  orbital_period   mass  distance  year shortform
0  Radial Velocity       1         269.300   7.10     77.40  2006        RV
1  Radial Velocity       1         874.774   2.21     56.95  2008        RV
2  Radial Velocity       1         763.000   2.60     19.84  2011        RV
3  Radial Velocity       1         326.030  19.40    110.62  2007        RV
4  Radial Velocity       1         516.220  10.50    119.47  2009        RV

In [ ]:
df=sns.load_dataset('planets')

In [ ]:
def shorten(s):
  return short_name.get(s,s)

In [ ]:
#As we are applying the same function this method is very efficient
df['short_method']=df['method'].apply(shorten)

In [ ]:
dfd.method.count()

50

In [ ]:
a={}
for s in df.method.unique():
  a[s]=0

In [ ]:
a

{'Astrometry': 0,
 'Eclipse Timing Variations': 0,
 'Imaging': 0,
 'Microlensing': 0,
 'Orbital Brightness Modulation': 0,
 'Pulsar Timing': 0,
 'Pulsation Timing Variations': 0,
 'Radial Velocity': 0,
 'Transit': 0,
 'Transit Timing Variations': 0}

In [ ]:
for i,r in df.iterrows():
  a[r['method']]+=1

In [ ]:
a

{'Astrometry': 2,
 'Eclipse Timing Variations': 9,
 'Imaging': 38,
 'Microlensing': 23,
 'Orbital Brightness Modulation': 3,
 'Pulsar Timing': 5,
 'Pulsation Timing Variations': 1,
 'Radial Velocity': 553,
 'Transit': 397,
 'Transit Timing Variations': 4}

In [ ]:
di={}
for m in df.method.unique():
  di[m]=df[df.method==m].method.count()
#  print(m,df[df.method==m].method.count())

In [ ]:
di

{'Astrometry': 2,
 'Eclipse Timing Variations': 9,
 'Imaging': 38,
 'Microlensing': 23,
 'Orbital Brightness Modulation': 3,
 'Pulsar Timing': 5,
 'Pulsation Timing Variations': 1,
 'Radial Velocity': 553,
 'Transit': 397,
 'Transit Timing Variations': 4}

In [ ]:
df.groupby('method')['method'].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

In [ ]:
x=df[(df['year'] >=2010)]['method'].count()

In [ ]:
dffd=df[(df['year'] >=2010)]
print(x)

597

In [ ]:
#Percentage of data found in last decade
dffd.groupby('method')['method'].count()/x

method
Astrometry                       0.003350
Eclipse Timing Variations        0.010050
Imaging                          0.030151
Microlensing                     0.021776
Orbital Brightness Modulation    0.005025
Pulsar Timing                    0.001675
Radial Velocity                  0.360134
Transit                          0.561139
Transit Timing Variations        0.006700
Name: method, dtype: float64

In [ ]:
#This is the fraction of planets found in last decade
s1=df[(df['year'] >=2010)].groupby('method')['method'].count()
s2=df.groupby('method')['method'].count()

In [ ]:
s1/s2

method
Astrometry                       1.000000
Eclipse Timing Variations        0.666667
Imaging                          0.473684
Microlensing                     0.565217
Orbital Brightness Modulation    1.000000
Pulsar Timing                    0.200000
Pulsation Timing Variations           NaN
Radial Velocity                  0.388788
Transit                          0.843829
Transit Timing Variations        1.000000
Name: method, dtype: float64

In [ ]:
df[(df['year'] <=2010)].groupby('method')['method'].count()

method
Astrometry                       1
Eclipse Timing Variations        5
Imaging                         26
Microlensing                    12
Pulsar Timing                    4
Pulsation Timing Variations      1
Radial Velocity                381
Transit                        110
Name: method, dtype: int64

# Test

In [ ]:
data =[['A',10],['B',15],['C',14],['D',14],['E',12],['F',10],['G',11]]
df=pd.DataFrame(data,index=['a','b','c','d','e','f','g'],columns=['Name','Age'])

In [ ]:
df=df.T
print(df['f']['Age'])

10

In [ ]:
y=df['Age']
print(type(y))

<class 'pandas.core.series.Series'>

In [ ]:
print(df['Age'][3])

14

In [ ]:
years2days = lambda x:x*365.25
X=df['Age'].apply(years2days)
print(X['Age'])

KeyError: ignored

In [ ]:
data =[['A',10],['B',15],['C',14],['D',14],['E',12],['F',10],['G',11]]
df=pd.DataFrame(data,columns=['Name','Age'])
grp=df.groupby('Age')
for g in grp:
  print(type(g[1]))
  break

<class 'pandas.core.frame.DataFrame'>

In [ ]:
data =[['A',10],['B',15],['C',14],['D',14],['E',12],['F',10],['G',11]]
df=pd.DataFrame(data,index=['a','b','c','d','e','f','g'],columns=['Name','Age'])
print(df.loc[1]['Age'])

TypeError: ignored